{
  "about": "Though I don’t come from a traditional computer science background, my passion and curiosity for technology are boundless!",
  "introduce": "Hello, my name is Kao TzuYuan, and I am a 24-year-old responsible, curious, and quick-learning <f2e>Front-end developer</f2e>. My passion for software development has grown since I was first introduced to programming through a university project.<br/><br/>To enhance my skills, I enrolled in an online course offered by <ac>ALPHACAMP</ac>, where I acquired a wealth of technical knowledge. However, I was not content with just that. I firmly believe that continuous learning and constant practice are key to becoming an excellent developer. Therefore, I seek out resources on the internet, purchase courses on <udemy>Udemy</udemy>, and strive to learn more technologies, applying this knowledge to real projects. I aim to channel my skills and passion into real projects, continuously learn and grow, and explore unknown areas with others who share my enthusiasm for software engineering.<br/><br/>My <goal>goal</goal> is to become an outstanding developer through relentless effort and practice, creating exceptional value in the field of software engineering.",
  "yesee-title": "Front-end Engineer · Yesee",
  "yesee-content": "During my tenure, I focused on developing and maintaining large-scale backend management systems primarily using Vue, Quasar, and TypeScript. I utilized Git for version control and frequently conducted code reviews and merges using Pull Requests.<br/><br/>Additionally, I participated in projects involving React, where I utilized Redux for state management to enhance application predictability and testability. In these projects, I employed Ant Design for rapid UI development and customization, improving development efficiency and UI consistency based on project requirements.",
  "aplhaCamp-title": "Full Stack Developer · ALPHA CAMP",
  "alphaCamp-content": "During this period, I gained a deep understanding of fundamental languages such as HTML, CSS, and JavaScript, and further honed my skills in using React to develop dynamic and efficient user interfaces. At the same time, I learned how to set up backend services using Node.js and Express.js, and I integrated a SQL database into my projects to manage data storage and retrieval.<br/><br/>For the final capstone project, I developed a podcast streaming platform using React. This platform integrated Spotify's OAuth login system, allowing users to easily sign in with their Spotify accounts and access personalized content. To achieve this, I thoroughly studied and implemented the OAuth 2.0 authentication process, and I used the Spotify API to fetch users' playlists, albums, and profile information. This experience not only helped me master the integration of third-party APIs but also enhanced my ability to handle authentication and security issues.",
  "movieHub-content": "MovieHub is a movie information website built with React and TypeScript, designed to provide an intuitive interface for searching and browsing movie information. The site leverages the API provided by TMDB to fetch the latest movie data, including movie details, trailers, cast information, and other movies featuring the cast.",
  "pokemon-content": "Since childhood, I've always been drawn to Pokémon. These adorable creatures have grown up with me, like loyal friends. Their evolution journey mirrors my childhood memories, continuing to accompany me. Inspired by these fond memories, I wanted to relive those nostalgic thrills.<br/><br/>This project is built using the React framework, integrating with the API provided by Pokémon to fetch data. The website features search and favorite functionalities.",
  "alphaCast-content": "This project is a creation based on the React framework, allowing users to easily explore and enjoy a variety of exciting playlists and podcasts through their Spotify account. It integrates with Spotify's API, enabling searching, favoriting, playback, and even operations like categorization and saving on these contents.<br/><br/>The highlight of this project lies in its rich features: you can effortlessly add, delete, modify, and query categories to organize your favorites better. Simultaneously, you can explore various playlists, view detailed information, and store your favorite playlists in your categorized collections anytime."
}
